Tekla Open API Reference for Tekla Structures 2025
MeshItemEnumerator.Current Property
 Returns a mesh item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MeshItem Current { get; }
Public ReadOnly Property Current As MeshItem
	Get
Property Value
Type: MeshItem
See Also
Reference
MeshItemEnumerator Class
Tekla.Structures.Catalogs Namespace